num1 = "20" 
# შეცდომა იმიტომარის რომ რიცხვი პრჭყალებსი წერია

name = Nuki
# აქ შეცდომაა რადგან სახელი ბრჭყალებში არ წერია

age <- 10
# აქ შეცდომაა რადგან ისრის მაგივრად ტოლობა უნდა ეწეროს

my name = "Nuki"
# აქ შეცდომაა რადგან დაშორება არ შეიძლება უნდა იყოს დახრილი ხაზი

num = 48
# ცვლადი არ უნდა იწყებოდეს ციფრით

this_is_a_very_long_variable_name = "example"
# ძალიან გრძელი სახელები ართულებენ კოდის წაკითხვას

is_open = "yes"  
# 'is_open' მოიაზრებს ლოგიკური (True/False) მნიშვნელობას, მაგრამ შეიცავს სტრიქონს

i = 0
# ერთ ასოიანი სახელი არ არის აღწერითი და ართულებს კოდის გაგებას

my-name = "Nuki"
# დეფისის გამოყენება არ შეიძლება

_=234
# მხოლლოდ დახრილი ხაზის გამოყენება არ შეიძლება