# ფსევდოკოდი და flowchart ორივე ხელსაწყოა, რომელიც გამოიყენება ალგორითმების და პროგრამული ლოგიკის უკეთ გასაგებად და დაგეგმვისთვის.
# მაგალითად: 

# age =int(input ("Please enter your age:"))
# if age >= 18: 
#   print("თქვენ ხართ ზრდასრული")
# else:
#    print("თქვენ არ ხართ ზრდასრული")


# მიმდევრობა არის როდესაც პროგრამა ინსტრუქციებს თანმიმდევრობით ასრულებს
# ინტერაცია არის პროცესის გამეორება რამდენჯერმე
# არჩევა არის პროცესი სადაც პროგრამა ირჩევს ერთერთ რამდენიმე შესაძლო გზას კონკრეტული პირობის საფუძველზე

# for i in range(101):
#    print("GOA BEST!")

# for i in range(20):
#    print(i)

# for i in range(15):
#    print(i * 2)